<a href="https://colab.research.google.com/github/Kevoen/Google_Colab_Rep/blob/master/%E7%AC%AC%E4%B8%80%E7%AB%A0%EF%BC%9A%E7%AC%AC%E4%B8%80%E8%8A%82%E6%95%B0%E6%8D%AE%E8%BD%BD%E5%85%A5%E5%8F%8A%E5%88%9D%E6%AD%A5%E8%A7%82%E5%AF%9F_%E8%AF%BE%E7%A8%8B.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

## 0. 连接与挂载Googel Drive
由于本人使用Google Colab进行实验，数据存储与Google Drive上，则需进行如下操作：

In [1]:
from google.colab import drive
drive.mount('/content/drive')

Go to this URL in a browser: https://accounts.google.com/o/oauth2/auth?client_id=947318989803-6bn6qk8qdgf4n4g3pfee6491hc0brc4i.apps.googleusercontent.com&redirect_uri=urn%3aietf%3awg%3aoauth%3a2.0%3aoob&scope=email%20https%3a%2f%2fwww.googleapis.com%2fauth%2fdocs.test%20https%3a%2f%2fwww.googleapis.com%2fauth%2fdrive%20https%3a%2f%2fwww.googleapis.com%2fauth%2fdrive.photos.readonly%20https%3a%2f%2fwww.googleapis.com%2fauth%2fpeopleapi.readonly&response_type=code

Enter your authorization code:
··········
Mounted at /content/drive

In [2]:
!ln -s /content/drive/My\ Drive/ /mydrive
%cd ../mydrive/Colab_Notebooks/DataWhela/Data\ Analysis

/content/drive/My Drive/Colab_Notebooks/DataWhela/Data Analysis

In [3]:
%cd ./hands-on-data-analysis/第一单元项目集合

/content/drive/My Drive/Colab_Notebooks/DataWhela/Data Analysis/hands-on-data-analysis/第一单元项目集合

**复习：**这门课程得主要目的是通过真实的数据，以实战的方式了解数据分析的流程和熟悉数据分析python的基本操作。知道了课程的目的之后，我们接下来我们要正式的开始数据分析的实战教学，完成kaggle上[泰坦尼克的任务](https://www.kaggle.com/c/titanic/overview)，实战数据分析全流程。
这里有两份资料：
教材《Python for Data Analysis》和 baidu.com &
google.com（善用搜索引擎）

## 1 第一章：数据载入及初步观察

### 1.1 载入数据
数据集下载 https://www.kaggle.com/c/titanic/overview

#### 1.1.1 任务一：导入numpy和pandas

In [4]:
#写入代码
import numpy as np
import pandas as pd

【提示】如果加载失败，学会如何在你的python环境下安装numpy和pandas这两个库

#### 1.1.2 任务二：载入数据
(1) 使用相对路径载入数据  
(2) 使用绝对路径载入数据

In [ ]:
#写入代码
df = pd.read_csv('train.csv')
df.head(3)

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S

[3 rows x 12 columns]

In [ ]:
#写入代码
df = pd.read_csv('/mydrive/Colab_Notebooks/DataWhela/Data Analysis/hands-on-data-analysis/第一单元项目集合/train.csv')
df.head(3)

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S

[3 rows x 12 columns]

【提示】相对路径载入报错时，尝试使用os.getcwd()查看当前工作目录。  
【思考】知道数据加载的方法后，试试pd.read_csv()和pd.read_table()的不同，如果想让他们效果一样，需要怎么做？了解一下'.tsv'和'.csv'的不同，如何加载这两个数据集？  
【总结】加载的数据是所有工作的第一步，我们的工作会接触到不同的数据格式（eg:.csv;.tsv;.xlsx）,但是加载的方法和思路都是一样的，在以后工作和做项目的过程中，遇到之前没有碰到的问题，要多多查资料吗，使用googel，了解业务逻辑，明白输入和输出是什么。

In [5]:
df = pd.read_table('train.csv')
df.head(3)

  PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0  1,0,3,"Braund, Mr. Owen Harris",male,22,1,0,A/...
1  2,1,1,"Cumings, Mrs. John Bradley (Florence Br...
2  3,1,3,"Heikkinen, Miss. Laina",female,26,0,0,S...

In [12]:
df = pd.read_table('train.csv',sep=',')
df.head(3)

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S

[3 rows x 12 columns]

```python
read Csv make_parser_ function（' read csv，， sep='，')
read csv= Appender（ read csv doc）（read csv read_table=make_parser_function（ read table'， sep='\t'）
read table=Appender（ read table doc）（read table）
```
他们的默认切割符号不一样,

read_table默认是'\t'(也就是tab)切割数据集的;

read_csv默认是','(也就是逗号)切割数据集的;

其他,除了方法名不一样,其他都相同

#### 1.1.3 任务三：每1000行为一个数据模块，逐块读取

In [20]:
#写入代码
# df = pd.read_csv('train.csv',chunksize=1000)
df = pd.read_table('train.csv',sep=',',chunksize=1000)
chunk = df.get_chunk() #获取一个数据块
print(chunk)

     PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0              1         0       3  ...   7.2500   NaN         S
1              2         1       1  ...  71.2833   C85         C
2              3         1       3  ...   7.9250   NaN         S
3              4         1       1  ...  53.1000  C123         S
4              5         0       3  ...   8.0500   NaN         S
..           ...       ...     ...  ...      ...   ...       ...
886          887         0       2  ...  13.0000   NaN         S
887          888         1       1  ...  30.0000   B42         S
888          889         0       3  ...  23.4500   NaN         S
889          890         1       1  ...  30.0000  C148         C
890          891         0       3  ...   7.7500   NaN         Q

[891 rows x 12 columns]

【思考】什么是逐块读取？为什么要逐块读取呢？

逐块读取是指将整个数据分成若干数据块，随后进行逐个读取；
由于通常数据集的数据量都是巨大的，如果直接读取所有数据，不仅速度慢，还消耗计算机资源；为了高效快捷的读取数据，从而使用逐块读取。

#### 1.1.4 任务四：将表头改成中文，索引改为乘客ID [对于某些英文资料，我们可以通过翻译来更直观的熟悉我们的数据]
PassengerId => 乘客ID  
Survived    => 是否幸存   
Pclass      => 乘客等级(1/2/3等舱位)  
Name        => 乘客姓名  
Sex         => 性别                 
Age         => 年龄                 
SibSp       => 堂兄弟/妹个数  
Parch       => 父母与小孩个数  
Ticket      => 船票信息             
Fare        => 票价                
Cabin       => 客舱                
Embarked    => 登船港口

In [ ]:
#写入代码
df = pd.read_csv('train.csv',names=['乘客ID','是否幸存','乘客等级','乘客姓名','性别','年龄','堂兄弟/妹个数','父母与小孩个数','船票信息','票价','客舱','登船港口'],index_col='乘客ID',header=0)
df.head(5)

【思考】所谓将表头改为中文其中一个思路是：将英文额度表头替换成中文。还有其他的方法吗？

In [ ]:
# 直接暴力修改
df = pd.read_csv('train.csv')
df.columns = ['乘客ID','是否幸存','乘客等级','乘客姓名','性别','年龄','堂兄弟/妹个数','父母与小孩个数','船票信息','票价','客舱','登船港口']
df.head()

In [ ]:
# 通过rename方法，注意参数inplace=True的时候，才能真正的在原来的DataFrame上进行修改。
df = pd.read_csv('train.csv')
df.rename(columns={'PassengerId':'乘客ID','Survived':'是否幸存','Pclass':'乘客等级','Name':'乘客姓名','Sex':'性别','Age':'年龄','SibSp':'堂兄弟/妹个数','Parch':'父母与小孩个数','Ticket':'船票信息','Fare':'票价','Cabin':'客舱','Embarked':'登船港口'},inplace=True)
df.head()

In [ ]:
# 索引修改，在rename方法，如果不写columns=xx就默认修改索引了。
df = pd.read_csv('train.csv')
df.rename({0:'PassengerId'})
# rename()函数适合于修改个别的索引或者列名，如果需要大部分的修改或者全部修改的话就使用set_index()函数比较方便。
df.set_index('PassengerId',inplace=True)

In [ ]:
# 修改表头与索引
df = pd.read_csv('train.csv')
df.rename(columns={'PassengerId':'乘客ID','Survived':'是否幸存','Pclass':'乘客等级','Name':'乘客姓名','Sex':'性别','Age':'年龄','SibSp':'堂兄弟/妹个数','Parch':'父母与小孩个数','Ticket':'船票信息','Fare':'票价','Cabin':'客舱','Embarked':'登船港口'},inplace=True)
df.set_index('乘客ID',inplace=True)
df.head()

### 1.2 初步观察
导入数据后，你可能要对数据的整体结构和样例进行概览，比如说，数据大小、有多少列，各列都是什么格式的，是否包含null等

#### 1.2.1 任务一：查看数据的基本信息

In [44]:
#写入代码
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 891 entries, 1 to 891
Data columns (total 11 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   是否幸存     891 non-null    int64
 1   乘客等级     891 non-null    int64
 2   乘客姓名     891 non-null    object
 3   性别       891 non-null    object
 4   年龄       714 non-null    float64
 5   堂兄弟/妹个数  891 non-null    int64
 6   父母与小孩个数  891 non-null    int64
 7   船票信息     891 non-null    object
 8   票价       891 non-null    float64
 9   客舱       204 non-null    object
 10  登船港口     889 non-null    object
dtypes: float64(2), int64(4), object(5)
memory usage: 83.5+ KB

【提示】有多个函数可以这样做，你可以做一下总结

In [ ]:
# DataFrame的基础属性
# 行数 列数
df.shape
# 列数据类型
df.dtypes
# 数据维度
df.ndim
# 行索引 
df.index
# 列索引
df.columns
# 对象值，二维ndarray数组
df.values

In [ ]:
# DataFrame整体情况
# 显示前10行，默认是5行
df.head(10)
# 显示末尾几行，默认是5
df.tail()
# 相关系数，如行数，列数，列索引、列非空值个数，列类型，内存占用
df.info()
# 快速统计结果，计数、均值、标准差、最大值、四分数、最小值
df.describe()

#### 1.2.2 任务二：观察表格前10行的数据和后15行的数据

In [45]:
#写入代码
df.head(10)

      是否幸存  乘客等级  ...    客舱 登船港口
乘客ID              ...
1        0     3  ...   NaN    S
2        1     1  ...   C85    C
3        1     3  ...   NaN    S
4        1     1  ...  C123    S
5        0     3  ...   NaN    S
6        0     3  ...   NaN    Q
7        0     1  ...   E46    S
8        0     3  ...   NaN    S
9        1     3  ...   NaN    S
10       1     2  ...   NaN    C

[10 rows x 11 columns]

In [46]:
#写入代码
df.head(15)

      是否幸存  乘客等级  ...    客舱 登船港口
乘客ID              ...
1        0     3  ...   NaN    S
2        1     1  ...   C85    C
3        1     3  ...   NaN    S
4        1     1  ...  C123    S
5        0     3  ...   NaN    S
6        0     3  ...   NaN    Q
7        0     1  ...   E46    S
8        0     3  ...   NaN    S
9        1     3  ...   NaN    S
10       1     2  ...   NaN    C
11       1     3  ...    G6    S
12       1     1  ...  C103    S
13       0     3  ...   NaN    S
14       0     3  ...   NaN    S
15       0     3  ...   NaN    S

[15 rows x 11 columns]

#### 1.2.4 任务三：判断数据是否为空，为空的地方返回True，其余地方返回False

In [53]:
#写入代码
df.isna().head()

       是否幸存   乘客等级   乘客姓名     性别     年龄  ...  父母与小孩个数   船票信息     票价     客舱   登船港口
乘客ID                                     ...
1     False  False  False  False  False  ...    False  False  False   True  False
2     False  False  False  False  False  ...    False  False  False  False  False
3     False  False  False  False  False  ...    False  False  False   True  False
4     False  False  False  False  False  ...    False  False  False  False  False
5     False  False  False  False  False  ...    False  False  False   True  False

[5 rows x 11 columns]

In [54]:
df.isnull().head()

       是否幸存   乘客等级   乘客姓名     性别     年龄  ...  父母与小孩个数   船票信息     票价     客舱   登船港口
乘客ID                                     ...
1     False  False  False  False  False  ...    False  False  False   True  False
2     False  False  False  False  False  ...    False  False  False  False  False
3     False  False  False  False  False  ...    False  False  False   True  False
4     False  False  False  False  False  ...    False  False  False  False  False
5     False  False  False  False  False  ...    False  False  False   True  False

[5 rows x 11 columns]

【总结】上面的操作都是数据分析中对于数据本身的观察

【思考】对于一个数据，还可以从哪些方面来观察？找找答案，这个将对下面的数据分析有很大的帮助

除了数值非空，还需要观察数据类型，数据正负性，数值范围

### 1.3 保存数据

#### 1.3.1 任务一：将你加载并做出改变的数据，在工作目录下保存为一个新文件train_chinese.csv

In [55]:
#写入代码
df.to_csv('train_chinese.csv')

【总结】数据的加载以及入门，接下来就要接触数据本身的运算，我们将主要掌握numpy和pandas在工作和项目场景的运用。